<?php  
$allGems = ['Хризолит', 'Эвклаз', 	'Корунд', 'Рубин', 'Сапфир', 'Тааффеит', 'Берилл', 'Аквамарин', 'Изумруд', 'Гелиодор', 'Морганит', 'Хризоберилл', 'Александрит', 'Шпинель', 'Гранаты', 'Демантоид', 'Цаворит', 'Спессартин', 'Пироп', 'Родолит', 'Альмандин', 'Кварц', 'Аметист', 'Цитрин', 'Горный хрусталь', 'Дымчатый кварц', 'Празиолит', 'Аметрин', 'Розовый кварц', 'Турмалин', 'Верделит', 'Индиголит', 'Параиба', 'Опал благородный', 'Опал огненный', 'Топаз', 'Танзанит', 'Циркон', 'Гиацинт', 'Андалузит'];
/////////////////////////////////////////////////////////////////////////////////////
$connect = mysqli_connect('localhost', 'root', '', 'creatures');
$query = mysqli_query($connect,"SELECT name_jewerly FROM `jewerly`");

/////////////////////////////////////////////////////////////////////////////////////
$sql_result = [];	
$i = 0;
$res = [];
/////////////////////////////////////////////////////////////////////////////////////
while ($row=mysqli_fetch_assoc($query)) {
	$sql_result[$i] = $row;
	$res_arr[$i] = [
		"name" => $sql_result[$i]["name_jewerly"],
	];	
	$i++;
};
/////////////////////////////////////////////////////////////////////////////////////
$res = array_merge($res, $res_arr);
echo json_encode($res);
?>